// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 4, 76, 3 -> [1, 2, 5, 7, 19,4,76,3]
// 6, 1, 33, 43, 12, 3 ,2, 9 -> [6, 1, 33,43,12,3,2,9]


int[] randomArray = new int[8];

for (int i = 0; i < 8; i++)
{
    randomArray[i] = new Random().Next(1, 199);
    Console.Write(randomArray[i] + ", ");
}
